renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/profile_cmn/r_ble_servc_if.c
            set_conn_idx(p_data->conn_hdl, p_conn_evt_param->p_addr);
        } break;

        case BLE_GATTC_EVENT_DISCONN_IND:
        {
            clear_conn_idx(p_data->conn_hdl);
        } break;

        case BLE_GATTC_EVENT_CHAR_READ_RSP:
        {
            st_ble_gattc_rd_char_evt_t *p_rd_char_evt_param =
                (st_ble_gattc_rd_char_evt_t *)p_data->p_param;

            read_evt_handler(p_data->conn_hdl,
                             p_rd_char_evt_param->read_data.attr_hdl,
                             &p_rd_char_evt_param->read_data.value,
                             result);
        } break;

        case BLE_GATTC_EVENT_CHAR_PART_READ_RSP:
        {
            st_ble_gattc_rd_char_evt_t *p_rd_char_evt_param =
                (st_ble_gattc_rd_char_evt_t *)p_data->p_param;

            const st_ble_servc_info_t      *p_client = NULL;
            const st_ble_servc_char_info_t *p_attr   = NULL;
            find_attr(conn_idx, p_rd_char_evt_param->read_data.attr_hdl, &p_client, &p_attr);

            if (NULL != p_attr)
            {
                if (p_rd_char_evt_param->read_data.attr_hdl ==
                    p_attr->p_attr_hdls[conn_idx].start_hdl + 1)
                {
                    if (BLE_SUCCESS == result)
                    {
                        if (NULL == gs_conn_info[conn_idx].p_read_buf)
                        {
                            gs_conn_info[conn_idx].p_read_buf = malloc(p_attr->db_size);
                            if(NULL == gs_conn_info[conn_idx].p_read_buf)
                            {
                                if (NULL != p_attr->read_rsp_cb)
                                {
                                    p_attr->read_rsp_cb(p_attr, p_data->conn_hdl, BLE_ERR_MEM_ALLOC_FAILED, NULL);
                                }
                                else
                                {
                                    st_ble_servc_evt_data_t evt_data = {
                                        .conn_hdl  = p_data->conn_hdl,
                                        .param_len = 0,
                                        .p_param   = NULL
                                    };
                                    if ((NULL != p_client) && (NULL != p_client->cb))
                                    {
                                        p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_READ_RSP), BLE_ERR_MEM_ALLOC_FAILED, &evt_data);
                                    }
                                }
                                break;
                            }
                            memset(gs_conn_info[conn_idx].p_read_buf, 0x00, p_attr->db_size);

                            gs_conn_info[conn_idx].read_buf_pos  = 0;
                            gs_conn_info[conn_idx].read_attr_hdl = p_rd_char_evt_param->read_data.attr_hdl;
                        }

                        memcpy(&gs_conn_info[conn_idx].p_read_buf[gs_conn_info[conn_idx].read_buf_pos],
                               p_rd_char_evt_param->read_data.value.p_value, 
                               p_rd_char_evt_param->read_data.value.value_len);
                        gs_conn_info[conn_idx].read_buf_pos =
                            (uint16_t )(gs_conn_info[conn_idx].read_buf_pos + p_rd_char_evt_param->read_data.value.value_len);
                    }
                    else
                    {
                        if (NULL != gs_conn_info[conn_idx].p_read_buf)
                        {
                            free(gs_conn_info[conn_idx].p_read_buf);
                            gs_conn_info[conn_idx].p_read_buf = NULL;
                            gs_conn_info[conn_idx].read_buf_pos  = 0;
                            gs_conn_info[conn_idx].read_attr_hdl = 0;
                        }

                        if (NULL != p_attr->read_rsp_cb)
                        {
                            p_attr->read_rsp_cb(p_attr, p_data->conn_hdl, result, NULL);
                        }
                        else
                        {
                            st_ble_servc_evt_data_t evt_data = {
                                .conn_hdl  = p_data->conn_hdl,
                                .param_len = 0,
                                .p_param   = NULL,
                            };
                            if ((NULL != p_client) && (NULL != p_client->cb))
                            {
                                p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_READ_RSP), result, &evt_data);
                            }
                        }
                    }
                }
                else
                {
                    for (uint8_t d = 0; d < p_attr->num_of_descs; d++)
                    {
                        if (p_rd_char_evt_param->read_data.attr_hdl ==
                            p_attr->pp_descs[d]->p_attr_hdls[conn_idx])
                        {
                            if (BLE_SUCCESS == result)
                            {
                                if (NULL == gs_conn_info[conn_idx].p_read_buf)
                                {
                                    gs_conn_info[conn_idx].p_read_buf    = malloc(p_attr->pp_descs[d]->db_size);
                                    if(NULL == gs_conn_info[conn_idx].p_read_buf)
                                    {
                                        st_ble_servc_evt_data_t evt_data = {
                                            .conn_hdl  = p_data->conn_hdl,
                                            .param_len = 0,
                                            .p_param   = NULL
                                        };
                                        if ((NULL != p_client) && (NULL != p_client->cb))
                                        {
                                            p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->pp_descs[d]->desc_idx, p_attr->pp_descs[d]->inst_idx, BLE_SERVC_READ_RSP), BLE_ERR_MEM_ALLOC_FAILED, &evt_data);
                                        }
                                        break;
                                    }
                                    memset(gs_conn_info[conn_idx].p_read_buf, 0x00, p_attr->pp_descs[d]->db_size);

