renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/profile_cmn/r_ble_servc_if.c
                                    gs_conn_info[conn_idx].read_buf_pos  = 0;
                                    gs_conn_info[conn_idx].read_attr_hdl = p_rd_char_evt_param->read_data.attr_hdl;
                                }

                                memcpy(&gs_conn_info[conn_idx].p_read_buf[gs_conn_info[conn_idx].read_buf_pos],
                                       p_rd_char_evt_param->read_data.value.p_value, 
                                       p_rd_char_evt_param->read_data.value.value_len);
                                gs_conn_info[conn_idx].read_buf_pos =
                                    (uint16_t )(gs_conn_info[conn_idx].read_buf_pos + p_rd_char_evt_param->read_data.value.value_len);
                            }
                            else
                            {
                                if (NULL != gs_conn_info[conn_idx].p_read_buf)
                                {
                                    free(gs_conn_info[conn_idx].p_read_buf);
                                    gs_conn_info[conn_idx].p_read_buf = NULL;
                                    gs_conn_info[conn_idx].read_buf_pos  = 0;
                                    gs_conn_info[conn_idx].read_attr_hdl = 0;
                                }

                                if (NULL != p_attr->pp_descs[d]->read_rsp_cb)
                                {
                                    p_attr->pp_descs[d]->read_rsp_cb(p_attr, p_data->conn_hdl, result, NULL);
                                }
                                else
                                {
                                    st_ble_servc_evt_data_t evt_data = {
                                        .conn_hdl  = p_data->conn_hdl,
                                        .param_len = 0,
                                        .p_param   = NULL,
                                    };
                                    if ((NULL != p_client) && (NULL != p_client->cb))
                                    {
                                        p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->pp_descs[d]->desc_idx, p_attr->pp_descs[d]->inst_idx, BLE_SERVC_READ_RSP), result, &evt_data);
                                    }
                                }
                            }
                            break;
                        }
                    }
                }
            }
        } break;

        case BLE_GATTC_EVENT_LONG_CHAR_READ_COMP:
        {
            if (NULL != gs_conn_info[conn_idx].p_read_buf)
            {
                st_ble_gatt_value_t value = {
                    .p_value   = gs_conn_info[conn_idx].p_read_buf,
                    .value_len = gs_conn_info[conn_idx].read_buf_pos,
                };

                read_evt_handler(p_data->conn_hdl,
                                 gs_conn_info[conn_idx].read_attr_hdl,
                                 &value,
                                 result);

                free(gs_conn_info[conn_idx].p_read_buf);
            }
            gs_conn_info[conn_idx].p_read_buf = NULL;
            gs_conn_info[conn_idx].read_buf_pos  = 0;
            gs_conn_info[conn_idx].read_attr_hdl = 0;
        } break;

        case BLE_GATTC_EVENT_CHAR_WRITE_RSP:
        {
            st_ble_gattc_wr_char_evt_t *p_wr_char_evt_param =
                (st_ble_gattc_wr_char_evt_t *)p_data->p_param;
            write_evt_handler(p_data->conn_hdl, p_wr_char_evt_param->value_hdl, result);
        } break;

        case BLE_GATTC_EVENT_CHAR_PART_WRITE_RSP:
        {
            st_ble_gattc_char_part_wr_evt_t *p_char_part_wr_param =
                (st_ble_gattc_char_part_wr_evt_t *)p_data->p_param;

            gs_conn_info[conn_idx].write_attr_hdl = p_char_part_wr_param->write_data.attr_hdl;
        } break;

        case BLE_GATTC_EVENT_LONG_CHAR_WRITE_COMP:
        {
            write_evt_handler(p_data->conn_hdl, gs_conn_info[conn_idx].write_attr_hdl, result);
        } break;

        case BLE_GATTC_EVENT_HDL_VAL_NTF:
        {
            st_ble_gatt_hdl_value_pair_t *p_hdl_value_pair_param =
                (st_ble_gatt_hdl_value_pair_t *)p_data->p_param;

            const st_ble_servc_info_t      *p_client = NULL;
            const st_ble_servc_char_info_t *p_attr   = NULL;
            find_attr(conn_idx, p_hdl_value_pair_param->attr_hdl, &p_client, &p_attr);

            if ((NULL != p_attr) && (NULL != p_attr->decode))
            {
                void *p_app_value;

                p_app_value = malloc(p_attr->app_size);
                if(NULL == p_app_value)
                {
                    result = BLE_ERR_MEM_ALLOC_FAILED;
                }
                else
                {
                    memset(p_app_value, 0x00, p_attr->app_size);

                    p_attr->decode(p_app_value, &p_hdl_value_pair_param->value);
                }
                if (NULL != p_attr->hdl_val_ntf_cb)
                {
                    p_attr->hdl_val_ntf_cb(p_attr, p_data->conn_hdl, p_app_value);
                }
                else
                {
                    st_ble_servc_evt_data_t evt_data = {
                        .conn_hdl  = p_data->conn_hdl,
                        .param_len = (NULL != p_app_value)?p_attr->app_size:0,
                        .p_param   = p_app_value,
                    };
                    if ((NULL != p_client) && (NULL != p_client->cb))
                    {
                        p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_HDL_VAL_NTF), result, &evt_data);
                    }
                }
                if (NULL != p_app_value)
                {
                    free(p_app_value);
                }
            }
        } break;

        case BLE_GATTC_EVENT_HDL_VAL_IND:
        {
            st_ble_gatt_hdl_value_pair_t *p_hdl_value_pair_param =
                (st_ble_gatt_hdl_value_pair_t *)p_data->p_param;

            const st_ble_servc_info_t      *p_client = NULL;
            const st_ble_servc_char_info_t *p_attr   = NULL;
            find_attr(conn_idx, p_hdl_value_pair_param->attr_hdl, &p_client, &p_attr);

            if ((NULL != p_attr) && (NULL != p_attr->decode))
            {
                void *p_app_value;

                p_app_value = malloc(p_attr->app_size);
                if(NULL == p_app_value)
                {
                    result = BLE_ERR_MEM_ALLOC_FAILED;
                }
                else
                {
                    memset(p_app_value, 0x00, p_attr->app_size);

                    p_attr->decode(p_app_value, &p_hdl_value_pair_param->value);
                }

                if (NULL != p_attr->hdl_val_ind_cb)
                {
                    p_attr->hdl_val_ind_cb(p_attr, p_data->conn_hdl, p_app_value);
                }
                else
                {
                    st_ble_servc_evt_data_t evt_data = {
                        .conn_hdl  = p_data->conn_hdl,
                        .param_len = (NULL != p_app_value)?p_attr->app_size:0,
                        .p_param   = p_app_value,
                    };
                    if ((NULL != p_client) && (NULL != p_client->cb))
                    {
                        p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_HDL_VAL_IND), result, &evt_data);
                    }
                }

                if (NULL != p_app_value)
                {
                    free(p_app_value);
                }
            }
        } break;

        case BLE_GATTC_EVENT_ERROR_RSP:
        {
            st_ble_gattc_err_rsp_evt_t *p_err_rsp_evt_param =
                (st_ble_gattc_err_rsp_evt_t *)p_data->p_param;

            const st_ble_servc_info_t      *p_client = NULL;
            const st_ble_servc_char_info_t *p_attr   = NULL;
            find_attr(conn_idx, p_err_rsp_evt_param->attr_hdl, &p_client, &p_attr);

            if (NULL != p_attr)
            {
                switch (p_err_rsp_evt_param->op_code)
                {
                    case 0x0A: /* Read Request */
                    {
                        if (NULL != p_attr->read_rsp_cb)
                        {
                            p_attr->read_rsp_cb(p_attr, p_data->conn_hdl, p_err_rsp_evt_param->rsp_code, NULL);
                        }
                        else
                        {
                            st_ble_servc_evt_data_t evt_data = {
                                .conn_hdl  = p_data->conn_hdl,
                                .param_len = 2,
                                .p_param   = &p_err_rsp_evt_param->attr_hdl,
                            };
                            if ((NULL != p_client) && (NULL != p_client->cb))
                            {
                                p_client->cb(BLE_SERVC_MULTI_ATTR_EVENT(p_attr->char_idx, p_attr->inst_idx, BLE_SERVC_READ_RSP), p_err_rsp_evt_param->rsp_code, &evt_data);
                            }
                        }
                    } break;

