renesas/rx-driver-package/source/r_ble_rx23w/r_ble_rx23w_vx.xx/r_ble_rx23w/src/app_lib/profile_cmn/r_ble_servc_if.c
    uint8_t *p_byte_value;
    p_byte_value = malloc(p_attr->db_size);
    if(NULL == p_byte_value)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }
    memset(p_byte_value, 0x00, p_attr->db_size);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = p_attr->p_attr_hdls[conn_idx],
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        free(p_byte_value);
        return BLE_ERR_INVALID_DATA;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (p_attr->db_size <= (mtu - 3))
    {
        ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
    }
    else
    {
        ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
    }

    free(p_byte_value);

    return ret;
}

ble_status_t R_BLE_SERVC_WriteDesc2(
    const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl, const void *p_app_value)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_app_value))
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint8_t *p_byte_value;
    p_byte_value = malloc(p_attr->db_size);
    if(NULL == p_byte_value)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }
    memset(p_byte_value, 0x00, p_attr->db_size);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = p_attr->db_size,
    };

    ret = p_attr->encode(p_app_value, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = p_attr->p_attr_hdls[conn_idx],
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        free(p_byte_value);
        return BLE_ERR_INVALID_DATA;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (write_data.value.value_len <= (mtu - 3))
    {
        ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
    }
    else
    {
        ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
    }

    free(p_byte_value);

    return ret;
}



ble_status_t R_BLE_SERVC_WriteDesc_with_Size(
    const st_ble_servc_desc_info_t *p_attr, uint16_t conn_hdl, const st_ble_seq_data_t *p_app_value)
{
    ble_status_t ret;

    if ((NULL == p_attr) || (NULL == p_app_value))
    {
        return BLE_ERR_INVALID_ARG;
    }

    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    if (0xFF == conn_idx)
    {
        return BLE_ERR_INVALID_HDL;
    }

    uint8_t *p_byte_value;
    uint16_t write_len;
    write_len = (p_app_value->len < p_attr->db_size) ? p_app_value->len : p_attr->db_size;

    p_byte_value = malloc(write_len);
    if(NULL == p_byte_value)
    {
        return BLE_ERR_MEM_ALLOC_FAILED;
    }
    memset(p_byte_value, 0x00, write_len);

    st_ble_gatt_value_t gatt_value = {
        .p_value   = p_byte_value,
        .value_len = write_len,
    };

    ret = p_attr->encode(p_app_value->data, &gatt_value);

    st_ble_gatt_hdl_value_pair_t write_data = {
        .attr_hdl        = p_attr->p_attr_hdls[conn_idx],
        .value.p_value   = gatt_value.p_value,
        .value.value_len = gatt_value.value_len,
    };

    if (BLE_SUCCESS != ret)
    {
        free(p_byte_value);
        return BLE_ERR_INVALID_DATA;
    }

    uint16_t mtu = BLE_GATT_DEFAULT_MTU;
    R_BLE_GATT_GetMtu(conn_hdl, &mtu);

    if (write_len <= (mtu - 3))
    {
        ret = R_BLE_GATTC_WriteChar(conn_hdl, &write_data);
    }
    else
    {
        ret = R_BLE_GATTC_WriteLongChar(conn_hdl, &write_data, 0);
    }

    free(p_byte_value);

    return ret;
}




void R_BLE_SERVC_ServDiscCb(const st_ble_servc_info_t *p_info, uint16_t conn_hdl, uint8_t serv_idx, uint16_t type, void *p_param)
{
    uint8_t conn_idx = find_conn_idx_from_conn_hdl(conn_hdl);
    /* unused arg */
    (void)serv_idx;

    if (0xFF == conn_idx)
    {
        return;
    }

    switch (type)
    {
        case BLE_DISC_PRIM_SERV_FOUND:
        {
            st_disc_serv_param_t *p_serv_param = (st_disc_serv_param_t *)p_param;
            memcpy(&p_info->p_attr_hdls[conn_idx], &p_serv_param->value.serv_16.range, sizeof(p_info->p_attr_hdls[conn_idx]));
        } break;

        case BLE_DISC_CHAR_FOUND:
        {
            st_disc_char_param_t *p_char_param = (st_disc_char_param_t *)p_param;

            for (uint8_t c = 0; c < p_info->num_of_chars; c++)
            {
                if ((BLE_GATT_16_BIT_UUID_FORMAT == p_char_param->uuid_type) &&
                    (p_info->pp_chars[c]->uuid_type == p_char_param->uuid_type) &&
                    (p_info->pp_chars[c]->uuid_16 == p_char_param->value.char_16.uuid_16) &&
                    (BLE_GATT_INVALID_ATTR_HDL_VAL == p_info->pp_chars[c]->p_attr_hdls[conn_idx].start_hdl))
                {
                    p_info->pp_chars[c]->p_attr_hdls[conn_idx].start_hdl = p_char_param->value.char_16.decl_hdl;

                    if (p_char_param->num_of_descs > 0)
                    {
                        p_info->pp_chars[c]->p_attr_hdls[conn_idx].end_hdl =
                            p_char_param->descs[p_char_param->num_of_descs-1].value.desc_16.desc_hdl;
                    }
                    else
                    {
                        p_info->pp_chars[c]->p_attr_hdls[conn_idx].end_hdl = p_char_param->value.char_16.value_hdl;
                    }

                    for (uint8_t d = 0; d < p_char_param->num_of_descs; d++)
                    {
                        for (uint8_t dd = 0; dd < p_info->pp_chars[c]->num_of_descs; dd++)
                        {
                            if ((BLE_GATT_16_BIT_UUID_FORMAT == p_char_param->descs[d].uuid_type) &&
                                (p_info->pp_chars[c]->pp_descs[dd]->uuid_16 == p_char_param->descs[d].value.desc_16.uuid_16) &&
                                (BLE_GATT_INVALID_ATTR_HDL_VAL == p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx]))
                            {
                                p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx] = p_char_param->descs[d].value.desc_16.desc_hdl;
                                break;
                            }
                            else if ((BLE_GATT_128_BIT_UUID_FORMAT == p_char_param->descs[d].uuid_type) &&
                                (0 == memcmp(p_info->pp_chars[c]->pp_descs[dd]->uuid_128, p_char_param->descs[d].value.desc_128.uuid_128, 0x10)) &&
                                (BLE_GATT_INVALID_ATTR_HDL_VAL == p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx]))    
                                {
                                    p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx] = p_char_param->descs[d].value.desc_128.desc_hdl;
                                    break;
                                }
                        }
                    }
                    break;
                }

                else if ((BLE_GATT_128_BIT_UUID_FORMAT == p_char_param->uuid_type) &&
                    (p_info->pp_chars[c]->uuid_type == p_char_param->uuid_type) &&
                    (0 == memcmp(p_info->pp_chars[c]->uuid_128, p_char_param->value.char_128.uuid_128, 0x10)) &&
                    (BLE_GATT_INVALID_ATTR_HDL_VAL == p_info->pp_chars[c]->p_attr_hdls[conn_idx].start_hdl))
                {
                    p_info->pp_chars[c]->p_attr_hdls[conn_idx].start_hdl = p_char_param->value.char_128.decl_hdl;

                    if (p_char_param->num_of_descs > 0)
                    {
                        p_info->pp_chars[c]->p_attr_hdls[conn_idx].end_hdl =
                            p_char_param->descs[p_char_param->num_of_descs-1].value.desc_16.desc_hdl;
                    }
                    else
                    {
                        p_info->pp_chars[c]->p_attr_hdls[conn_idx].end_hdl = p_char_param->value.char_128.value_hdl;
                    }

                    for (uint8_t d = 0; d < p_char_param->num_of_descs; d++)
                    {
                        for (uint8_t dd = 0; dd < p_info->pp_chars[c]->num_of_descs; dd++)
                        {
                            if ((BLE_GATT_16_BIT_UUID_FORMAT == p_char_param->descs[d].uuid_type) &&
                                (p_info->pp_chars[c]->pp_descs[dd]->uuid_16 == p_char_param->descs[d].value.desc_16.uuid_16) &&
                                (BLE_GATT_INVALID_ATTR_HDL_VAL == p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx]))
                            {
                                p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx] = p_char_param->descs[d].value.desc_16.desc_hdl;
                                break;
                            }
                            else if ((BLE_GATT_128_BIT_UUID_FORMAT == p_char_param->descs[d].uuid_type) &&
                                (0 == memcmp(p_info->pp_chars[c]->pp_descs[dd]->uuid_128, p_char_param->descs[d].value.desc_128.uuid_128, 0x10)) &&
                                (BLE_GATT_INVALID_ATTR_HDL_VAL == p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx]))
                            {
                                p_info->pp_chars[c]->pp_descs[dd]->p_attr_hdls[conn_idx] = p_char_param->descs[d].value.desc_128.desc_hdl;
                                break;
                            }
                        }
                    }
                    break;

                }
            }
        } break;

        default:
        {
            /* Do nothing. */
        } break;
    }
}

uint8_t R_BLE_SERVC_GetConnIdx(const st_ble_dev_addr_t *p_addr)
{
    return find_conn_idx_from_bd_addr(p_addr);
}
